In [4]:
import pandas as pd
import sqlalchemy
from sqlalchemy import create_engine

In [5]:
SERVER_NAME = 'ISOKOVPC'
DATABASE_NAME = 'Roster'
DRIVER = 'ODBC+Driver+17+for+SQL+Server'
CONNECTION_STRING = f'mssql+pyodbc://{SERVER_NAME}/{DATABASE_NAME}?trusted_connection=yes&driver={DRIVER}'

ms_sql_engine = create_engine(CONNECTION_STRING)

In [19]:
table = pd.read_sql_table('Roster', ms_sql_engine)

table

             name  Species  age
0  Benjamin Sisko    Human   40
1      Jadzia Dax    Trill  300
2      Kira Nerys  Bajoran   29

In [21]:
table['name'] = table['name'].replace({'Jadzia Dax': 'Ezri Dax'})
table

             name  Species  age
0  Benjamin Sisko    Human   40
1        Ezri Dax    Trill  300
2      Kira Nerys  Bajoran   29

In [24]:
table.loc[table['Species'] == 'Bajoran', ['name', 'age']]

         name  age
2  Kira Nerys   29